// task 3
let admin;
let name = 'Василий';

admin = name;
console.log(admin);

// task 4
// Чему будет равно JS-выражение 1000 + "108"
// Ответ:
//        1000108

// task 5
// Самостоятельно разобраться с атрибутами тега script (async и defer)
// Ответ:
//        async - асинхронное выполнение. То есть выполняется параллельно с загрузкой html
// и не мешает ему.
//        defer - не запустит скрипт пока html полностью не прочитается
// Также разница - с параметром async первым запустится тот скрипт, который первее загрузится
//                 с параметром defer первым запустится скрипт, который находится выше.
